from dataclasses import dataclass, field, asdict
from typing import Dict, Optional
import json

# Design
@dataclass
class Design:
    speed: int
    prefix: str

# Mast
@dataclass
class Band:
    index: Dict[str, Dict[str, Dict[str, int]]]
    yoffset: Dict[str, Dict[str, Dict[str, float]]]

@dataclass
class Mast:
    index: Dict[str, Dict[str, int]]
    gauge: Dict[str, float]
    foundation: Dict[str, int]
    band: Band

# Bracket
@dataclass
class Bracket:
    index: Dict[str, Dict]
    fitting: Dict[str, Dict]
    coordinates: Dict[str, Dict[str, float]]
    height: Dict[str, float]

# RailwayConfig 전체 구조
@dataclass
class RailwayConfig:
    design: Design
    mast: Mast
    bracket: Bracket
    feeder: Dict[str, int]
    spreader: Dict[str, Dict[str, int]]
    wire: Dict[str, Dict]

config_150 = RailwayConfig(
    design=Design(speed=150, prefix="수도권용"),
    mast=Mast(
        index={
            "일반개소": {"토공": 1370, "교량": 1371, "터널": 1400},
            "평행개소": {"토공": 1375, "교량": 1376, "터널": 1400}
        },
        gauge={"토공": 3, "교량": 3.5, "터널": 2.15},
        foundation={"토공": 623, "교량": 626, "터널": 0},
        band=Band(
            index={
                "가동브래킷용": {
                    "P10": {"상부": 685, "하부": 691},
                    "P12": {"상부": 686, "하부": 692}
                },
                "완철용": {"P10": 790, "P12": 890}
            },
            yoffset={
                "가동브래킷용": {
                    "토공": {"상부": 6.1, "하부": 5.1},
                    "교량": {"상부": 6.1, "하부": 4.9},
                    "터널": {"상부": 0, "하부": 0}
                },
                "완철용": {"토공": 8.323, "교량": 8.323, "터널": 0}
            }
        )
    ),
    bracket=Bracket(
        index={
            "일반개소": {
                "터널": {"직선": {"I": 649, "O": 650}, "곡선": {"I": 633, "O": 634}},
                "토공": {"직선": {"I": 1252, "O": 1253}, "곡선": {"I": 629, "O": 630}},
                "교량": {"직선": {"I": 1254, "O": 1255}, "곡선": {"I": 631, "O": 632}}
            },
            "에어조인트": {
                "터널": {"I": 633, "O": 634},
                "토공": {"I": 629, "O": 630},
                "교량": {"I": 631, "O": 632}
            },
            "F브래킷": {"터널": {"I": 634, "O": 634}, "토공": {"I": 630, "O": 630}, "교량": {"I": 632, "O": 632}}
        },
        fitting={
            "전차선지지금구": {"무효인상용": None},
            "조가선지지금구": {"일반용": None, "에어조인트용": None, "무효인상용": None},
            "곡선당김금구": {"I": {"L": 1293, "R": 1294}, "O": {"L": 599, "R": 609}, "F": {"L": 303, "R": 1292}}
        },
        coordinates={
            "F형_시점": {"x": 0.35, "y": 0.3},
            "AJ형_시점": {"x": 0.15, "y": 0},
            "AJ형_중간1": {"x": 0.15, "y": 0},
            "AJ형_중간2": {"x": 0.15, "y": 0},
            "AJ형_끝": {"x": 0.15, "y": 0},
            "F형_끝": {"x": 0.35, "y": 0.3}
        },
        height={"F": 0.3}
    ),
    feeder={"토공": 1234, "교량": 1234, "터널": 1249},
    spreader={"토공": {"1m": 531, "1.6m": 532}, "교량": {"1m": 534, "1.6m": 535}, "터널": {"1m": 537, "1.6m": 538}},
    wire={
        "offset": {
            "AF": {"토공": {"x": 1.637, "y": 7.228381}, "교량": {"x": 2.137, "y": 7.228381}, "터널": {"x": 1.919, "y": 5.479}},
            "FPW": {"토공": {"x": 3.239, "y": 4.89}, "교량": {"x": 3.7397, "y": 4.89}, "터널": {"x": 2.3, "y": 4.89}},
            "CW": {"토공": 5.2, "교량": 5.2, "터널": 5}
        },
        "system_height": {"토공": 0.96, "교량": 0.96, "터널": 0.71}
    }
)

config_250 = RailwayConfig(
    design=Design(speed=250, prefix="Cako250"),
    mast=Mast(
        index={
            "일반개소": {"토공": 1370, "교량": 1371, "터널": 1400},
            "평행개소": {"토공": 1375, "교량": 1376, "터널": 1400}
        },
        gauge={"토공": 3, "교량": 3.5, "터널": 2.15},
        foundation={"토공": 623, "교량": 626, "터널": 0},
        band=Band(
            index={
                "가동브래킷용": {
                    "P10": {"상부": 685, "하부": 691},
                    "P12": {"상부": 686, "하부": 692}
                },
                "완철용": {"P10": 790, "P12": 890}
            },
            yoffset={
                "가동브래킷용": {
                    "토공": {"상부": 6.3, "하부": 5.1},
                    "교량": {"상부": 6.3, "하부": 4.7},
                    "터널": {"상부": 0, "하부": 0}
                },
                "완철용": {"토공": 8.323, "교량": 8.323, "터널": 0}
            }
        )
    ),
    bracket=Bracket(
        index={
            "일반개소": {
                "터널": {"직선": {"I": 647, "O": 648}, "곡선": {"I": 1325, "O": 1326}},
                "토공": {"직선": {"I": 641, "O": 642}, "곡선": {"I": 1296, "O": 1297}},
                "교량": {"직선": {"I": 643, "O": 644}, "곡선": {"I": 1298, "O": 1299}}
            },
            "에어조인트": {
                "터널": {"I": 1325, "O": 1326},
                "토공": {"I": 1296, "O": 1297},
                "교량": {"I": 1298, "O": 1299}
            },
            "F브래킷": {"터널": {"I": 1290, "O": 1291}, "토공": {"I": 1284, "O": 1285}, "교량": {"I": 1286, "O": 1287}}
        },
        fitting={
            "전차선지지금구": {"무효인상용": 1282},
            "조가선지지금구": {"일반용": None, "에어조인트용": 1279, "무효인상용": 1281},
            "곡선당김금구": {"I": {"L": 1280, "R": 1283}, "O": {"L": 1280, "R": 1283}, "F": {"L": None, "R": None}}
        },
        coordinates={
            "F형_시점": {"x": 0.3, "y": 0.32},
            "AJ형_시점": {"x": 0.1, "y": 0},
            "AJ형_중간1": {"x": 0.1, "y": 0},
            "AJ형_중간2": {"x": 0.1, "y": 0},
            "AJ형_끝": {"x": 0.1, "y": 0},
            "F형_끝": {"x": 0.3, "y": 0.32}
        },
        height={"F": 0}
    ),
    feeder={"토공": 1234, "교량": 1234, "터널": 1249},
    spreader={"토공": {"1m": 531, "1.6m": 532}, "교량": {"1m": 534, "1.6m": 535}, "터널": {"1m": 537, "1.6m": 538}},
    wire={
        "offset": {
            "AF": {"토공": {"x": 1.637, "y": 7.228381}, "교량": {"x": 2.137, "y": 7.228381}, "터널": {"x": 1.919, "y": 5.479}},
            "FPW": {"토공": {"x": 3.239, "y": 4.89}, "교량": {"x": 3.7397, "y": 4.89}, "터널": {"x": 2.3, "y": 4.89}},
            "CW": {"토공": 5.2, "교량": 5.2, "터널": 5}
        },
        "system_height": {"토공": 1.2, "교량": 1.2, "터널": 0.85}
    }
)

config_350 = RailwayConfig(
    design=Design(speed=350, prefix="고속철도용"),
    mast=Mast(
        index={
            "일반개소": {"토공": 619, "교량": 620, "터널": 621},
            "평행개소": {"토공": 619, "교량": 620, "터널": 621}
        },
        gauge={"토공": 3.267, "교량": 3.5156, "터널": 2.1},
        foundation={"토공": None, "교량": None, "터널": None},
        band=Band(
            index={
                "가동브래킷용": {
                    "P10": {"상부": None, "하부": None},
                    "P12": {"상부": None, "하부": None}
                },
                "완철용": {"P10": None, "P12": None}
            },
            yoffset={
                "가동브래킷용": {
                    "토공": {"상부": None, "하부": None},
                    "교량": {"상부": None, "하부": None},
                    "터널": {"상부": None, "하부": None}
                },
                "완철용": {"토공": None, "교량": None, "터널": None}
            }
        )
    ),
    bracket=Bracket(
        index={
            "일반개소": {
                "터널": {"직선": {"I": 569, "O": 568}, "곡선": {"I": 569, "O": 568}},
                "토공": {"직선": {"I": 564, "O": 565}, "곡선": {"I": 564, "O": 565}},
                "교량": {"직선": {"I": 566, "O": 567}, "곡선": {"I": 566, "O": 567}}
            },
            "에어조인트": {
                "터널": {"I": 639, "O": 640},
                "토공": {"I": 635, "O": 636},
                "교량": {"I": 637, "O": 638}
            },
            "F브래킷": {"터널": {"I": 582, "O": 583}, "토공": {"I": 578, "O": 579}, "교량": {"I": 580, "O": 581}}
        },
        fitting={
            "전차선지지금구": {"무효인상용": 584},
            "조가선지지금구": {"일반용": None, "에어조인트용": 586, "무효인상용": 585},
            "곡선당김금구": {"I": {"L": 576, "R": 577}, "O": {"L": 576, "R": 577}, "F": {"L": None, "R": None}}
        },
        coordinates={
            "F형_시점": {"x": 0.3, "y": 0.32},
            "AJ형_시점": {"x": 0.1, "y": 0},
            "AJ형_중간1": {"x": 0.1, "y": 0},
            "AJ형_중간2": {"x": 0.1, "y": 0},
            "AJ형_끝": {"x": 0.1, "y": 0},
            "F형_끝": {"x": 0.3, "y": 0.32}
        },
        height={"F": 0}
    ),
    feeder={"토공": 597, "교량": 597, "터널": 598},
    spreader={"토공": {"1m": 587, "1.6m": 588}, "교량": {"1m": 589, "1.6m": 590}, "터널": {"1m": 587, "1.6m": 588}},
    wire={
        "offset": {
            "AF": {"토공": {"x": 4.356, "y": 6.154}, "교량": {"x": 2.419, "y": 8.133}, "터널": {"x": 1.598, "y": 8.067}},
            "FPW": {"토공": {"x": 3.42, "y": 5.505}, "교량": {"x": 3.671, "y": 5.505}, "터널": {"x": 2.206, "y": 7.766}},
            "CW": {"토공": 5.08, "교량": 5.08, "터널": 5.08}
        },
        "system_height": {"토공": 1.4, "교량": 1.4, "터널": 1.4}
    }
)

configs = {
    150: config_150,
    250: config_250,
    350: config_350
}

def save_configs(configs, path="c:/temp"):
    for speed, cfg in configs.items():
        with open(f"{path}/railway_{speed}.json", "w", encoding="utf-8") as f:
            json.dump(asdict(cfg), f, ensure_ascii=False, indent=2)
def get_config(speed: int) -> RailwayConfig:
    return configs[speed]

# 필요할 때 꺼내쓰기
if __name__ == "__main__":
    save_configs(configs)