from MODEL import RailwayConfig, Design, Mast, Band, Bracket

config_150 = RailwayConfig(
    design=Design(speed=150, prefix="수도권용"),
    mast=Mast(
        index={
            "일반개소": {"토공": 1370, "교량": 1371, "터널": 1400},
            "평행개소": {"토공": 1375, "교량": 1376, "터널": 1400}
        },
        gauge={"토공": 3, "교량": 3.5, "터널": 2.15},
        foundation={"토공": 623, "교량": 626, "터널": 0},
        band=Band(
            index={
                "가동브래킷용": {
                    "P10": {"상부": 685, "하부": 691},
                    "P12": {"상부": 686, "하부": 692}
                },
                "완철용": {"P10": 790, "P12": 890}
            },
            yoffset={
                "가동브래킷용": {
                    "토공": {"상부": 6.1, "하부": 5.1},
                    "교량": {"상부": 6.1, "하부": 4.9},
                    "터널": {"상부": 0, "하부": 0}
                },
                "완철용": {"토공": 8.323, "교량": 8.323, "터널": 0}
            }
        )
    ),
    bracket=Bracket(
        index={
            "일반개소": {
                "터널": {"I": 633, "O": 634},
                "토공": {"I": 629, "O": 630},
                "교량": {"I": 631, "O": 632}
            },
            "에어조인트": {
                "터널": {"I": 633, "O": 634},
                "토공": {"I": 629, "O": 630},
                "교량": {"I": 631, "O": 632}
            },
            "F브래킷": {"터널": {"I": 634, "O": 634}, "토공": {"I": 630, "O": 630}, "교량": {"I": 632, "O": 632}}
        },
        fitting={
            "전차선지지금구": {"무효인상용": None},
            "조가선지지금구": {"일반용": 983, "에어조인트용": 983, "무효인상용": 983},
            "곡선당김금구": {"I": {"L": 1293, "R": 1294}, "O": {"L": 599, "R": 609}, "F": {"L": 303, "R": 1292}}
        },
    ),
    feeder={"토공": 1234, "교량": 1234, "터널": 1249},
    spreader={"토공": {"1m": 531, "1.6m": 532}, "교량": {"1m": 534, "1.6m": 535}, "터널": {"1m": 537, "1.6m": 538}},
    wire={
        "offset": {
            "AF": {"토공": {"x": 1.637, "y": 7.228381}, "교량": {"x": 2.137, "y": 7.228381}, "터널": {"x": 1.919, "y": 5.479}},
            "FPW": {"토공": {"x": 3.239, "y": 5.1}, "교량": {"x": 3.7397, "y": 4.9}, "터널": {"x": 2.3, "y": 4.89}},
            "CW": {"토공": 5.2, "교량": 5.2, "터널": 5}
        },
        "system_height": {"토공": 0.96, "교량": 0.96, "터널": 0.71}
    },
    airjoint={
        'offset' :{
            "F형_시점": {"x": 0.35, "y": 0.3},
            "AJ형_시점": {"x": 0.15, "y": 0},
            "AJ형_중간1": {"x": 0.15, "y": 0},
            "AJ형_중간2": {"x": 0.15, "y": 0},
            "AJ형_끝": {"x": 0.15, "y": 0},
            "F형_끝": {"x": 0.35, "y": 0.3}
        },
        'bracket_height' : 0.3
    },
    airsection={
        'offset':{
            "F형_시점": {"x": 0.7, "y": 0.37},
            "AS형_시점": {"x": 0.2, "y": 0},
            "AS형_중간1": {"x": 0.25, "y": 0},
            "AS형_중간2": {"x": 0.25, "y": 0},
            "AS형_끝": {"x": 0.2, "y": 0},
            "F형_끝": {"x": 0.7, "y": 0.37}
        },
        'bracket_height' : 0.37
    }
)