from MODEL import RailwayConfig, Design, Mast, Band, Bracket

config_350 = RailwayConfig(
    design=Design(speed=350, prefix="고속철도용"),
    mast=Mast(
        index={
            "일반개소": {"토공": 619, "교량": 620, "터널": 798},
            "평행개소": {"토공": 619, "교량": 620, "터널": 798}
        },
        gauge={"토공": 3.267, "교량": 3.5156, "터널": 2.295},
        foundation={"토공": None, "교량": None, "터널": None},
        band=Band(
            index={
                "가동브래킷용": {
                    "H250": {"상부": None, "하부": None},
                    "H300": {"상부": None, "하부": None},
                },
                "완철용": {"H250": None, "H300": None}
            },
            yoffset={
                "가동브래킷용": {
                    "토공": {"상부": None, "하부": None},
                    "교량": {"상부": None, "하부": None},
                    "터널": {"상부": None, "하부": None}
                },
                "완철용": {"토공": None, "교량": None, "터널": None}
            }
        )
    ),
    bracket=Bracket(
        index={
            "일반개소": {
                "터널": {"I": 896, "O": 897},
                "토공": {"I": 892, "O": 893},
                "교량": {"I": 894, "O": 895}
            },
            "에어조인트": {
                "터널": {"I": 639, "O": 640},
                "토공": {"I": 635, "O": 636},
                "교량": {"I": 637, "O": 638}
            },
            "F브래킷": {"터널": {"I": 582, "O": 583}, "토공": {"I": 578, "O": 579}, "교량": {"I": 580, "O": 581}}
        },
        fitting={
            "전차선지지금구": {"무효인상용": 584},
            "조가선지지금구": {"일반용": None, "에어조인트용": 586, "무효인상용": 585},
            "곡선당김금구": {"I": {"L": 576, "R": 577}, "O": {"L": 576, "R": 577}, "F": {"L": None, "R": None}}
        }
    ),
    feeder={"토공": 597, "교량": 898, "터널": 598},
    spreader={"토공": {"1m": 587, "1.6m": 588}, "교량": {"1m": 589, "1.6m": 590}, "터널": {"1m": 587, "1.6m": 588}},
    wire={
        "offset": {
            "AF": {"토공": {"x": 4.356, "y": 6.154}, "교량": {"x": 2.419, "y": 8.133}, "터널": {"x": 1.598, "y": 8.067}},
            "FPW": {"토공": {"x": 3.42, "y": 5.505}, "교량": {"x": 3.671, "y": 5.505}, "터널": {"x": 2.206, "y": 7.766}},
            "CW": {"토공": 5.08, "교량": 5.08, "터널": 5.08}
        },
        "system_height": {"토공": 1.4, "교량": 1.4, "터널": 1.4}
    },
    airjoint={
        'offset':{
            "F형_시점": {"x": 0.35, "y": 0.55},
            "AJ형_시점": {"x": 0.15, "y": 0},
            "AJ형_중간1": {"x": 0.1, "y": 0},
            "AJ형_중간2": {"x": 0.1, "y": 0},
            "AJ형_끝": {"x": 0.15, "y": 0},
            "F형_끝": {"x": 0.35, "y": 0.55}
        },
        'bracket_height':0
    },
    airsection={
        'offset':{
            "F형_시점": {"x": 0.7, "y": 0.55},
            "AS형_시점": {"x": 0.2, "y": 0},
            "AS형_중간1": {"x": 0.25, "y": 0},
            "AS형_중간2": {"x": 0.25, "y": 0},
            "AS형_끝": {"x": 0.2, "y": 0},
            "F형_끝": {"x": 0.7, "y": 0.55}
        },
        'bracket_height':0
    }
)