from MODEL import RailwayConfig, Design, Mast, Band, Bracket

config_250 = RailwayConfig(
    design=Design(speed=250, prefix="Cako250"),
    mast=Mast(
        index={
            "일반개소": {"토공": 1370, "교량": 1371, "터널": 1400},
            "평행개소": {"토공": 1375, "교량": 1376, "터널": 1400}
        },
        gauge={"토공": 3, "교량": 3.5, "터널": 2.15},
        foundation={"토공": 623, "교량": 626, "터널": 0},
        band=Band(
            index={
                "가동브래킷용": {
                    "P10": {"상부": 685, "하부": 691},
                    "P12": {"상부": 686, "하부": 692}
                },
                "완철용": {"P10": 790, "P12": 890}
            },
            yoffset={
                "가동브래킷용": {
                    "토공": {"상부": 6.3, "하부": 5.1},
                    "교량": {"상부": 6.3, "하부": 4.9},
                    "터널": {"상부": 0, "하부": 0}
                },
                "완철용": {"토공": 8.323, "교량": 8.323, "터널": 0}
            }
        )
    ),
    bracket=Bracket(
        index={
            "일반개소": {
                "터널": {"I": 1325, "O": 1326},
                "토공": {"I": 1296, "O": 1297},
                "교량": {"I": 1298, "O": 1299}
            },
            "에어조인트": {
                "터널": {"I": 1325, "O": 1326},
                "토공": {"I": 1296, "O": 1297},
                "교량": {"I": 1298, "O": 1299}
            },
            "에어섹션":{
                "터널": {"I": 1325, "O": 1326},
                "토공": {"I": 1296, "O": 1297},
                "교량": {"I": 1298, "O": 1299}
            },
            "F브래킷": {"터널": {"I": 1290, "O": 1291}, "토공": {"I": 1284, "O": 1285}, "교량": {"I": 1286, "O": 1287}}
        },
        fitting={
            "전차선지지금구": {"무효인상용": 1282},
            "조가선지지금구": {"일반용": None, "에어조인트용": 1279, "무효인상용": 1281},
            "곡선당김금구": {"I": {"L": 1280, "R": 1283}, "O": {"L": 1280, "R": 1283}, "F": {"L": None, "R": None}}
        },
    ),
    feeder={"토공": 1234, "교량": 1234, "터널": 1249},
    spreader={"토공": {"1m": 531, "1.6m": 532}, "교량": {"1m": 534, "1.6m": 535}, "터널": {"1m": 537, "1.6m": 538}},
    wire={
        "offset": {
            "AF": {"토공": {"x": 1.637, "y": 7.228381}, "교량": {"x": 2.137, "y": 7.228381}, "터널": {"x": 1.919, "y": 5.479}},
            "FPW": {"토공": {"x": 3.239, "y": 5.1}, "교량": {"x": 3.7397, "y": 4.89}, "터널": {"x": 2.3, "y": 4.89}},
            "CW": {"토공": 5.2, "교량": 5.2, "터널": 5}
        },
        "system_height": {"토공": 1.2, "교량": 1.2, "터널": 0.85}
    },
    airjoint={
        'offset':{
            "F형_시점": {"x": 0.3, "y": 0.32},
            "AJ형_시점": {"x": 0.1, "y": 0},
            "AJ형_중간1": {"x": 0.1, "y": 0},
            "AJ형_중간2": {"x": 0.1, "y": 0},
            "AJ형_끝": {"x": 0.1, "y": 0},
            "F형_끝": {"x": 0.3, "y": 0.32}
        },
        'bracket_height' : 0
    },
    airsection={
        'offset':{
            "F형_시점": {"x": 0.7, "y": 0.37},
            "AS형_시점": {"x": 0.2, "y": 0},
            "AS형_중간1": {"x": 0.25, "y": 0},
            "AS형_중간2": {"x": 0.25, "y": 0},
            "AS형_끝": {"x": 0.2, "y": 0},
            "F형_끝": {"x": 0.7, "y": 0.37}
            },
        'bracket_height' : 0
    }
)